from scenarios import *
if __name__ == "__main__":
    is_need_exit = False

    while not is_need_exit:
        print("+++ Практическая работа №1: Введение в ООП: создание классов, конструкторов классов, методов классов; наследование +++")
        print("=" * 119)
        print("1) Сценарий 1: создание склада, добавление товаров и обход итератором")
        print("2) Сценарий 2: копирование склада, изменение товара в копии и проверка независимости оригинального склада")
        print("3) Сценарий 3: перемещение склада через конструктор перемещения, проверка отсутствия копирования")
        print("4) Сценарий 4: поиск товаров по ID, категории и цене, удаление по ID и индексу")
        print("5) Сценарий 5: перемещение товара между складами через TransferTo, изменение остатков и цены")
        print("\n0) Выйти из программы")
        print("=" * 119)
        user_choice = int(input("Введите команды: "))

        match(user_choice):
            case 0:
                is_need_exit = True
                continue
            case 1:
                print()
                scenario_1()

            case 2:
                print()
                scenario_2()

            case 3:
                print()
                scenario_3()
            case 4:
                print()
                scenario_4()

            case 5:
                print()
                scenario_5()

            case _:
                print("Такого сценария нет! Введите значение от 1 до 5!")

        input("Нажмите Enter для возвращения в меню")